app/controllers/exitus_controller.rb

SELECT "exitus".* FROM "exitus"
---
  def index
    @exitus = Exitu.all