app/controllers/families_controller.rb

SELECT "families".* FROM "families"
---
  def index
    @families = Family.all

SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @family = Family.find(params[:id])
    @patient = Patient.find(params[:id])

SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @family = Family.find(params[:id])

SELECT "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "families" SET "family_name" = 'va beeeee o noooo', "phone" = '', "mobile_phone" = '', "family_name_2" = '', "phone_2" = '', "mobile_phone_2" = '', "updated_at" = '2012-11-24 12:19:36.338749' WHERE "families"."id" = 1
---
  def update
    @family = Family.find(params[:id])

    respond_to do |format|
      if @family.update_attributes(params[:family])