app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(params[:patient])
    @patient.user = current_user

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("admission", "birth_date", "cap", "cap_doctor", "cip", "code", "created_at", "dni", "exit", "exitus", "image", "insurance_comp", "name", "registered", "room", "sex", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @patient = Patient.find(params[:id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "7"]]

  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]